ProgrammingTestTask-1/src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСрокаГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ProgrammingTestTask-1/src/Documents/Приходная/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеОСрокеГодности();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаПроизводстваПриИзменении(Элемент)
	ЗаполнитьДанныеОСрокеГодности();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСрокГодностиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ОкончаниеСрокаГодности = 	ОбщегоНазначенияВызовСервера.ДобавитьКДатеКоличествоДней(ТекущиеДанные.ДатаПроизводства, ТекущиеДанные.СрокГодности);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОкончаниеСрокаГодностиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.СрокГодности = ОбщегоНазначенияВызовСервера.ВычислитьКоличествоДнейМеждуДатами(ТекущиеДанные.ОкончаниеСрокаГодности, ТекущиеДанные.ДатаПроизводства);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДанныеОСрокеГодности()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ДанныеОСрокеГодности = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОСрокеГодностиНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.ДатаПроизводства);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеОСрокеГодности);

КонецПроцедуры

#КонецОбласти
